
help_message = """
Чтоб перейти к покупке команду /buy
Правила /terms
"""
help_Connection_Instructions_qr = """
*Инструкция по подключению к VPN* 🌐
✨*Подключение через QR-код* 📲
1️⃣*Скачайте и установите WireGuard*
➖ [Windows, macOS, Linux](https://www.wireguard.com/install/)
➖ [Android](https://play.google.com/store/apps/details?id=com.wireguard.android&hl=ru&pli=1)
➖ [iOS](https://apps.apple.com/ru/app/wireguard/id1441195209)
2️⃣*Запустите WireGuard.*
3️⃣*Добавьте конфигурацию через QR-код*
➖ Нажмите на кнопку ➕ в интерфейсе приложения.
➖ Выберите *"Создать из QR-кода"*.
➖ Наведите камеру на QR-код, который был предоставлен вам после покупки подписки.
4️⃣*Подключитесь к VPN*
➖ После сканирования QR-кода конфигурация автоматически добавится в приложение.
---
Если у вас возникли вопросы или проблемы, напишите нам в поддержку! 😊
"""
help_Connection_Instructions_file = """
*Инструкция по подключению к VPN* 🌐
✨*Подключение через конфигурационный файл* 📂
1️⃣*Сохраните файл*
2️⃣*Скачайте и установите WireGuard*
➖ [Windows, macOS, Linux](https://www.wireguard.com/install/)
➖ [Android](https://play.google.com/store/apps/details?id=com.wireguard.android&hl=ru&pli=1)
➖ [iOS](https://apps.apple.com/ru/app/wireguard/id1441195209)
3️⃣*Добавьте файл в WireGuard*
➖ Откройте приложение WireGuard.
➖ Нажмите на кнопку `+` в интерфейсе приложения.
➖ Выберите *"Создать из файла или архива"*.
➖ Найдите и выберите сохранённый `.conf`-файл.
4️⃣*Подключитесь к VPN*
➖ После импорта файла конфигурация автоматически добавится в приложение.
➖ Нажмите на тумблер рядом с названием конфигурации, чтобы включить или отключить VPN.
---
Если у вас возникли вопросы или проблемы, напишите нам в поддержку! 😊
"""

