
help_message = """
Чтоб перейти к покупке команду /buy
Правила /terms
"""
help_Connection_Instructions_qr = """
*Инструкция по подключению к VPN* 🌐
✨*Подключение через QR-код* 📲
1️⃣*Скачайте и установите WireGuard*
➖ [Windows, macOS, Linux](https://www.wireguard.com/install/)
➖ [Android](https://play.google.com/store/apps/details?id=com.wireguard.android&hl=ru&pli=1)
➖ [iOS](https://apps.apple.com/ru/app/wireguard/id1441195209)
2️⃣*Запустите WireGuard.*
3️⃣*Добавьте конфигурацию через QR-код*
➖ Нажмите на кнопку ➕ в интерфейсе приложения.
➖ Выберите *"Создать из QR-кода"*.
➖ Наведите камеру на QR-код, который был предоставлен вам после покупки подписки.
4️⃣*Подключитесь к VPN*
➖ После сканирования QR-кода конфигурация автоматически добавится в приложение.
---
Если у вас возникли вопросы или проблемы, напишите нам в поддержку! 😊
"""
help_Connection_Instructions_file = """
*Инструкция по подключению к VPN* 🌐
✨*Подключение через конфигурационный файл* 📂
1️⃣*Сохраните файл*
2️⃣*Скачайте и установите WireGuard*
➖ [Windows, macOS, Linux](https://www.wireguard.com/install/)
➖ [Android](https://play.google.com/store/apps/details?id=com.wireguard.android&hl=ru&pli=1)
➖ [iOS](https://apps.apple.com/ru/app/wireguard/id1441195209)
3️⃣*Добавьте файл в WireGuard*
➖ Откройте приложение WireGuard.
➖ Нажмите на кнопку `+` в интерфейсе приложения.
➖ Выберите *"Создать из файла или архива"*.
➖ Найдите и выберите сохранённый `.conf`-файл.
4️⃣*Подключитесь к VPN*
➖ После импорта файла конфигурация автоматически добавится в приложение.
➖ Нажмите на тумблер рядом с названием конфигурации, чтобы включить или отключить VPN.
---
Если у вас возникли вопросы или проблемы, напишите нам в поддержку! 😊
"""

mess_doesnt_work_vpn = f"""
*Я всегда рад вам помочь,но для начала 👇 прочитай ответы на частые вопросы ниже❗️*
1️⃣ На данный момент сотовые операторы и провайдеры блокируют все VPN в России, но у нас есть обход всех блокировок. Откройте меню бота, кнопка где поле для ввода текста. В главном меню > Выбрать регион > Смените регион.
2️⃣ Если у вас не прошла оплата, то напишите в бота «проблемы с оплатой» и последние 4 цифры карты с которой оплачивали. Скрины бот не понимает! Текстом пожалуйста. Возможно оплата прошла, перейдите в меню бота «мои активные ключи» и смотрите активные и их срок действия.
3️⃣ Сервера работают без перебоев, но ваш телефон может менять сеть, при этом впн переподключается (с сотовой на вай фай), может быть не стабильный сигнал сотовой сети, ваш телефон не хочет обновлять днс или ваш роутер. Отключите впн, закройте все приложения, включите режим в самолете, далее обратно, потом впн. У вас все будет работать! Это всегда будет помогать и не связано с впн.
4️⃣ Далее про Инстаграм! Если у вас все сайты открывает, а инстаграм нет, то это известная причина и она у многих. Они обновили приложение! Нужно полностью удалить приложение инстаграм и установить снова. Проблема будет решена навсегда!
5️⃣ Так же есть старые роутеры без поддержки впн и роутеры в публичных зонах (кафе, магазины…). Эти проблемы не на нашей стороне, у нас все работает 24/7.
6️⃣ Если у вас не работает впн только через сотовою связь, то напишите нам в боте. На данный момент операторы блокируют впн подключения, но мы постоянно работаем над обходами.

Если ВПН не работает и Ваш случай попадает под пункты выше, то напишите мне @zoomkaXXX
    """
mess_profile_vpn_user = f"""
🚨 ЛИЧНЫЙ КАБИНЕТ VPN 🚨

🌟 У вас активна подписка на VPN сервис!
⏳ Срок действия: [Укажите количество месяцев] месяцев
📅 Дата окончания подписки: [Укажите дату]

🔒 Настройте безопасное подключение уже сегодня!
🌐 Доступ к глобальной сети без ограничений
🛡️ 100% защита ваших данных

❗️ Не забудьте продлить подписку до указанной даты для непрерывного использования сервиса
"""