push_pay_sub_24h = """
🚨 ВАЖНОЕ УВЕДОМЛЕНИЕ 🚨

Дорогой пользователь!

⚠️ Ваша подписка на VPN истекает уже ЗАВТРА! ⚠️

Чтобы продолжить безопасно пользоваться в интернете, защищать свои данные и оставаться анонимным в сети, не забудьте продлить подписку.

🔒 Без активной подписки:
• Ваш трафик больше не будет защищен
• Доступ к международным ресурсам будет ограничен
• Защита ваших данных прекратится

👉 Продлите подписку прямо сейчас и получите:
✅ Непрерывную защиту ваших данных
✅ Доступ ко всем функциям сервиса
✅ Безлимитный трафик
✅ Поддержку круглосуточно

Спасибо, что выбираете нас!
Ваш надежный проводник в безопасный интернет ✅
"""